openfoam/template/0/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 39;

boundaryField
{
    inlet       { type fixedValue; value uniform 39; }
    outlet      { type zeroGradient; }
    farfield    { type freestream; freestreamValue uniform 39; }
    wall        { type kqRWallFunction; value uniform 39; }
}
